AuthApi/testing/load-test.yaml
config:
  phases:
    - duration: 70
      arrivalRate: 12

scenarios:
  - flow:
    - post:
        url: "/api/v1/login"
        json: 
          emailAddress: "validuser@test.com"
          password: "password"

    - post:
        url: "/api/v1/user"
        json:
          emailAddress: "testuser{{$randomString()}}@test.com"
          password: "password"